content/posts/elasticsearch_for_pdf_libraries.md
+++
title = "elasticsearch for pdf libraries"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:50-04:00
slug = "elasticsearch_for_pdf_libraries"
draft = false
+++

## [library]({{< relref "library" >}}), [computation]({{< relref "computation" >}}), [web development]({{< relref "web_development" >}}), [elasticsearch]({{< relref "elasticsearch" >}}) {#library--library-dot-md--computation--computation-dot-md--web-development--web-development-dot-md--elasticsearch--elasticsearch-dot-md}


## links {#links}


### [How To Index A PDF File As An Elasticsearch Index | ObjectRocket](<https://kb.objectrocket.com/elasticsearch/how-to-index-a-pdf-file-as-an-elasticsearch-index-267>) {#how-to-index-a-pdf-file-as-an-elasticsearch-index-objectrocket--https-kb-dot-objectrocket-dot-com-elasticsearch-how-to-index-a-pdf-file-as-an-elasticsearch-index-267}


### [Apache Tika – Apache Tika](<https://tika.apache.org/>) for batch conversion of many document types to text {#apache-tika-apache-tika--https-tika-dot-apache-dot-org--for-batch-conversion-of-many-document-types-to-text}


### [Ingest Attachment Processor Plugin | Elasticsearch Plugins and Integrations | Elastic](<https://www.elastic.co/guide/en/elasticsearch/plugins/current/ingest-attachment.html>) for ingesting pdfs to elasticsearch {#ingest-attachment-processor-plugin-elasticsearch-plugins-and-integrations-elastic--https-www-dot-elastic-dot-co-guide-en-elasticsearch-plugins-current-ingest-attachment-dot-html--for-ingesting-pdfs-to-elasticsearch}


### [Building a Full-Text Search App Using Docker and Elasticsearch](<https://blog.patricktriest.com/text-search-docker-elasticsearch/>) {#building-a-full-text-search-app-using-docker-and-elasticsearch--https-blog-dot-patricktriest-dot-com-text-search-docker-elasticsearch}


## deployment {#deployment}


### <https://operatorhub.io/operator/elastic-cloud-eck> [kubernetes]({{< relref "kubernetes" >}}), [elasticsearch]({{< relref "elasticsearch" >}}) {#https-operatorhub-dot-io-operator-elastic-cloud-eck-kubernetes--kubernetes-dot-md--elasticsearch--elasticsearch-dot-md}
